{"id":"2015-08-1017005292","title":"Batara Sianturi: Teamwork, passion & execution","url":"","date":"2015-08-10","text":"Senior Citibanker Batara Sianturi builds stronger teamwork with his participative management approach.\n\nSitting relaxed at his office in the South Jakarta Central Business District, Batara Sianturi, the newly appointed chief executive officer Citi Indonesia, smiles benignly.\n\nHe has returned to his motherland with a wealth of global banking experience gained during his overseas postings. His decade of international assignments included helming the Philippine and Central Eastern Europe offices.\n\nWith an international career at Citibank (Citi) spanning more than 27 years, Batara now leads some 5,000 staff members across the archipelago. As the CEO, he is responsible for all Citi businesses in the franchise in Indonesia.\n\nDespite his strong academic background in engineering, as he has both undergraduate and graduate degrees in the subject, Batara has long had an interest in the world of finance. This later prompted him to pursue a master's degree in finance. He spent all of his academic years in the US.\n\nRegardless of his interest in the subject, his leadership savvy is what has played a greater role in his management success.\n\nAs he engaged in a warm chat with The Jakarta Post, the father of three pointed out three elements that highlight his secret strategy in leading such a big organization as Citi '\" teamwork, passion and execution.\n\n'It's always easy to talk about teamwork to achieve your management goal, but it's always harder to build good teamwork. The harmony of solid teamwork is where we rely on each other, we share the same vision and we work toward that particular goal,' he asserted.\n\nA good leader in a company is often not the smartest person in the organization. But the most important characteristic needed in any leader is the ability to synergize the different levels of agility possessed by his or her subordinates. 'That's why I put teamwork at the top of the list in my leadership strategy. It's all about 'we', not 'me'. We like a superstar, but we prefer a winning team,' he added.\n\nWorking takes passion to succeed. Regardless of where people work, Batara commented, 'we need to be passionate about what we do and about the vision of the work we do. For me, having vision is knowing where you are, where you want to go and how to get there. So, the leader must be able to explain this and put it into action: this is where we are, that is where we want to go and this is how to get there.'\n\nWhat differentiates a winning team from a losing team is the execution, the 55-year-old banker further explained. 'Right now, my focus is to relate execution with ethics. Execution is very important but it must be accompanied by the highest standard of ethics. The harmony of these two is crucial in a business, especially in the banking sector as we are in the business of trust.'\n\nThe banking landscape has changed. In the past, he continued, transparency was mainly aimed at shareholders. 'As the world is becoming more connected, information flows very fast. So, in the execution, it is vital that we involve all parties, such as stakeholders, the regulator, the private and public sectors, the community and the media. We need to be transparent and show them that we execute our business operations at the highest ethical standard.'\n\nTo make the most of his strategic implementation of these three elements, Batara uses participative management.\n\n'For me, participative management is crucial in building solid teamwork. It's where a leader must know the 'what' and the 'how'. Sometimes, we focus too much on the 'what' and we forgot that the 'how' is just as important as the 'what'. And sometimes, the 'how' differentiates the quality of the execution, so in that process a leader must make the team believe in the vision and must lead the way to show the 'how'. If we put our energy together, then you'll put more resources in ensuring the 'how' is executed flawlessly.'\n\nMaintaining credibility\n\nCiti has had a presence in Indonesia since 1968. Currently, it operates 20 branches in six major cities '\" Jakarta, Bandung, Surabaya, Semarang, Medan and Denpasar.\n\nAs one of the largest foreign banks in the archipelago, Citi recorded total assets as of December last year at US$5.2 billion (around Rp 65 trillion).\n\n'The strength of Citibank is its globality. We are the only bank to have a presence in more than 100 countries and operate in more or less 160 countries. Not only does globality provide a network, it also caters to our clients with connectivity in payments and business trade.\n\n'Globality has become one of the trends along with urbanization and digitalization.'\n\nHeading toward the Asian Economic Community, set to start in December this year, Batara expresses optimism that Citibank is ready to play a role in the community.\n\n'Let's say there's a client in the Philippines seeking to expand his business in Indonesia. Citibank Philippines can connect Citibank Indonesia to help expand that client's business in Indonesia. The harmonious relationship between our network and AEC will pave the way for better business expansion opportunities throughout the ASEAN community.'\n\nBatara further said that maintaining Citi's leadership in credit card and multinational corporate banking is one of his agendas as the CEO.\n\n'We pioneered the credit card business in this country and we want to maintain that leadership in terms of innovation and in terms of more value for credit card products. It's the same with our corporate banking clients. I'm confident that I can maintain and possibly take our products to the next level, so long as I stick with the three elements of my leadership strategy I previously mentioned '\" teamwork, passion and execution.'\n\n____________________________________\n\nCareer Highlights\n\nChief executive officer (CEO) Citi Indonesia (June 2015-present); CEO for the Philippines and cluster head for the Philippines and Guam (2013-2015); CEO for Hungary and cluster head for 12 other countries in Central Eastern Europe (2007-2013); head of consumer bank, Citi Hungary (2005-2007); general manager, overseas mortgages, Citi Australia (1995-1996); various positions, from management associate to director, Citi Indonesia (1988'\"2005).\n\nAt Ease\n\nFamily ties\n\nWeekends are for my family. My wife and I have been blessed with two sons and a daughter. Nothing is better than spending quality time on a weekend than getting together with my wife, our 19-year-old son and 18-year-old son. Our 24-year-old daughter, the eldest, lives in Europe.\n\nAvid reader\n\nI like to read. Much of my spare time is spent on reading. With today's fast development of the Internet, I've start reading more online, but I still love the physical form of books. I read a variety of topics, but mostly financial and non-fiction books.\n\nStaying fit\n\nI enjoy sports, especially swimming and running. I don't swim as much as I used to, but I still run on a frequent basis. I do a 10-kilometer run three times a week.\n\nHoliday destinations\n\nTraveling is one way that I appreciate the art of living. Budapest, London and New York are high on my list of my favorite cities. I like exploring big cities with all the amenities to offer.\n\nEducation\n\nBachelor of Science in chemical engineering and polymer science from Case Western Reserve University, US (1979-1983); Master of chemical engineering from Stevens Institute of Technology, US (1983-1984); MBA in finance from Saint John's University (1986-1988).","lang":"eng","eventUri":"null","isDuplicate":false}
{"id":"1021435142","title":"Harland Clarke Holdings Announces Appointment of Erik Prusch as New CEO; Victor Nichols to Serve as Chairman","url":"","date":"2018-12-18","text":"SAN ANTONIO--(BUSINESS WIRE)--Dec 18, 2018--Harland Clarke Holdings (HCH) today announced that accomplished business executive Erik Prusch will join the company as Chief Executive Officer effective January 1, 2019. Victor Nichols, who is the current CEO, has made the personal decision to step back from his operating role and move into the Chairman position where he will continue to support strategic initiatives and client relationships. Chuck Dawson, the current Chairman, will serve as the Vice-Chairman.\n\nVictor Nichols has been the CEO of Harland Clarke Holdings since 2017 and was previously the CEO of Valassis when he joined the company in April 2015. Under Nichols' leadership, the company has grown through strategic acquisitions, organic growth and the continued advancement of new product solutions with a focus on digital transformation.\n\n\"It has been an honor to serve in this leadership capacity alongside talented team members who consistently deliver exceptional solutions for our clients. I am looking forward to supporting our growth strategies in the Chairman role,\" said Victor Nichols. \"I am very pleased that Erik Prusch will step into the CEO role and continue to accelerate the delivery of market-leading products for our clients. He is a strong, reputable leader who thrives in highly dynamic environments and will build upon our solid foundation of success while driving outstanding results for our stakeholders.\"\n\nErik Prusch has extensive experience leading, innovating and scaling media and technology companies, including his proficient ability to guide companies through rapid evolution. He is a seasoned executive, having occupied multiple successful Chief Executive Officer roles at various companies including Outerwall, Clearlake Capital Group, Clearwire, and Borland Software Corporation, in which he oversaw significant revenue growth within all those businesses. Earlier in his career, he served in senior leadership positions with Intuit, Identix, Gateway Computers, Koch Industries, and PepsiCo. Prusch earned his Bachelor's degree in Economics from Yale University, and his MBA from the NYU Stern School of Business.\n\n\"It is an extremely exciting time to join Harland Clarke Holdings,\" said Prusch. \"With a dedication for excellence, an eagerness to drive accelerated innovation, and an enthusiasm for exceeding client expectations, all delivered by incredibly passionate team members, HCH is well-positioned to continue on its positive growth trajectory. I am looking forward to partnering with the talented HCH leadership and team members while leading Harland Clarke Holdings through its next phase of growth.\"\n\n\"Harland Clarke Holdings continues to thrive as it provides a variety of advanced business solutions, leveraging large-scale and unique technology, data, operations, distribution and communications to meet client and consumers' ever-evolving needs. I am grateful for Victor Nichols' unwavering commitment in guiding us with his strategic leadership and pleased he will partner with our teams as he moves to the Chairman role,\" said Ronald O. Perelman, Chairman and CEO, MacAndrews & Forbes Incorporated. \"We are excited to have Erik Prusch's strong track record of successful management and business performance that will be leveraged across all the Harland Clarke Holdings' businesses.\"\n\nAbout Harland Clarke Holdings\n\nHarland Clarke Holdings is comprised of companies focused on optimizing client relationships through multiple channels by enabling them to acquire, retain and grow their customer base. Its major business units, Valassis, Harland Clarke, RetailMeNot and Scantron are recognized as leading providers of incentive advertising, marketing services, transaction solutions, education services and intelligent media delivery that create millions of customer touch points annually for their clients. Harland Clarke Holdings is a wholly owned subsidiary of MacAndrews & Forbes Incorporated.\n\nView source version on businesswire.com:https://www.businesswire.com/news/home/20181218005475/en/\n\nCONTACT: Debbie Serot, SVP Corporate Communications\n\nINDUSTRY KEYWORD: TECHNOLOGY SOFTWARE COMMUNICATIONS ADVERTISING MARKETING OTHER COMMUNICATIONS","lang":"eng","eventUri":"null","isDuplicate":false}
{"id":"1019090905","title":"General Electric : Burned Out -5- | MarketScreener","url":"","date":"2018-12-15","text":"The process was shrouded in secrecy up until the end. After Immelt informed the board of his intention to step down, a small staff worked out of human-resources chief Susan Peters' apartment to write the press release and other materials for the announcements.\n\nA 30-year GE veteran, Flannery had yet to be told he had won the job. On Friday, June 9, less than three weeks after the Sarasota conference, Flannery got a call. Immelt was out. He was in.\n\nBald and bespectacled, Flannery was nothing like Immelt. He was soft-spoken and analytical. More accountant than salesman, he lacked Immelt's booming presence and charisma.\n\nFlannery was Trian's ideal successor, a balm for its frustrations with Immelt. He had an investor's mind-set, crunched numbers naturally and was obsessed with the cash businesses produced.\n\nFlannery, whose father was president of a small Connecticut bank, spent most of his years at GE Capital after getting his M.B.A. from Wharton. He worked in risk management, private equity and eventually rose to be the head of mergers and acquisitions. He had spent years imagining a more streamlined GE and was bewildered by its inability to meet cost-cutting targets.\n\nFor some, that made him dry. For others, including the GE board, he was just what GE needed. He knew of Immelt's flaws and wanted to change the culture to encourage debate and focus. Some of Immelt's signature endeavors and buzzwords evaporated when Flannery ascended.\n\nIt was tempting to cast him as the anti-Jeff, but he was instrumental in the Alstom deal, arguing it would be a valuable asset.\n\nFlannery was also a GE die-hard, just as his predecessor and his rivals for the job. Flannery told associates after taking over that he kept a \"f -- you list\" bearing the names of those who had done GE wrong, especially those who left the company.\n\nA SHORT HONEYMOON\n\nJohn Flannery didn't waste any time. Even before he was supposed to officially start as CEO in August, he launched a review of each business unit, scuttled a futuristic building planned for the new Boston headquarters, and grounded the fleet of corporate jets that Immelt had used so extravagantly that he had a spare plane follow him around the world. Each Friday, even if Flannery was on business overseas, he answered employee questions in a recorded video, helping to boost spirits.\n\nHe also made a pilgrimage to Nantucket to see Jack Welch, then 81, who has a house there. Some expected Flannery to be more like Welch and less like Immelt; in the aviation division some workers were walking around chanting \"Jack is back.\" The enthusiasm was double-edged, an endorsement of Flannery and a rebuke of Immelt.\n\nThe honeymoon didn't last long. Flannery was expected to make things better, but he revealed in his first conference call in July that he wouldn't lay out his strategy until November. Investors used to Immelt's optimism were left mired in uncertainty. GE's stock dropped nearly 3%, to $25.91 a share.\n\nFlannery soon learned that things were worse inside GE Power than he had known. The service contracts tweaked when Steve Bolze was in the running for CEO made earnings look better on paper, but delayed money coming in. Factories were holding a glut of expensive inventory because the division had prepared for growth into a market that was collapsing, tying up more cash.\n\nThe mess in Power led to the abrupt departures of key GE veterans, a move some inside the company worried would leave the rookie CEO short of experienced hands to help revive GE's fortunes.\n\nBolze had left soon after losing the CEO competition. The secrecy of the succession race meant there wasn't another leader ready to step in at Power. It was still integrating the company's largest-ever acquisition and about to enter one of the biggest-ever slumps in the power-generation market.\n\nImmelt, who had stayed on as chairman, didn't stick around for the new CEO to dismantle what he had built. He left the company where he had spent most of his life in October, months earlier than expected. A few days later, Flannery nudged out Immelt's top lieutenants, marketing chief Beth Comstock and international business head John Rice.\n\nAs the board was gathering in October for a monthly meeting, Flannery stepped into the room to make an announcement: Bornstein, the company's hard-nosed CFO, was resigning. Bornstein himself later came in to explain his decision. They were likely to have to offer Trian a seat on the board. Leaving now might spare directors some conflict between Trian and management. Bornstein would depart along with Comstock and Rice.\n\nIt blindsided several directors, leaving them disappointed the board hadn't been consulted. They felt they could have persuaded Bornstein to stay on. The CFO's resignation caused more worry from investors. GE announced Bornstein's departure after the market closed on a humdrum Friday.\n\nThe next big news wasn't long in coming, and this time it involved addition instead of subtraction. That Monday, GE named Trian's Ed Garden to its board, a move months in the making after the company failed to hit the targets Bornstein had agreed to in his Back Bay townhouse. Investors drove down GE stock almost 4% to $23.43 by the time the market closed.\n\nFlannery and the board, wanting to avoid a proxy fight, added Garden without opposition. Some directors welcomed the new voice, even if Garden could prove abrasive at times, while others on the board were blunt in declaring their distaste for him.\n\nGarden was fond of reminding them all that Trian had lost hundreds of millions of dollars on their watch. Now, he had a direct say in decisions and access to all of GE's financial secrets.\n\nTHE ANTI-JEFF\n\nIf Jeff Immelt was known for his vaulting optimism, John Flannery quickly became known for his boundless brooding.\n\nFew decisions, even major ones, were final as he devised the strategy he promised to unveil in November. Flannery relentlessly sought input from outsiders, searching for flaws in his reasoning. The feedback meant a decision, like selling off a division, could be reassessed at any time.\n\nHe repeatedly conferred with the board and encouraged debate. Under Flannery, the board or its committees had dozens of meetings and conference calls. In just one year, they got together in one way or another 50 times.\n\nFlannery felt more analysis and scrutiny was exactly what GE needed. Too often, the company under Immelt had made major decisions about how to spend its cash without enough rigor. And because of GE's decentralized structure, Flannery felt he needed time to better understand the disparate units despite his three decades working at GE.\n\nThe whole process, invigorating at first after Immelt's dislike of dissent, quickly became grating to the top executives.\n\nBy the time the third-quarter results came in October, the stock was below $25 and losing ground. GE warned that full-year cash flow from its industrial businesses would now be $7 billion, a shadow of the earlier guidance of $12 billion. The loss was almost entirely from the troubled Power division.\n\nWith the November date for releasing his strategy to investors rushing toward him, Flannery was forced to stop agonizing, even though his plan remained a work in progress.\n\nHours before several hundred investors, analysts and reporters packed into a large wood-paneled meeting room in Midtown Manhattan on Nov. 13, GE disclosed it would cut its dividend in half.\n\nSome of Flannery's explanation was familiar -- he blamed the previous management of GE Power -- and some of it was new and unnerving. \"We've been paying a dividend in excess of our free cash flow for a number of years now,\" he said.\n\nIn the dry language of accounting in which he was so fluent, Flannery was declaring a pillar of Immelt's pivot had failed: GE had been sending money out the door to repurchase its stock and pay dividends but wasn't bringing in enough from its regular operations to cover them. It wasn't sustainable. Buybacks and dividends are generally paid out of leftover funds.\n\nFlannery warned it would take years to fix some of the company's businesses and laid out a future for three core markets -- power, aviation and health care -- while planning to jettison smaller divisions, such as transportation and lighting.\n\nDespite the wait, there was no radical restructuring, and just as it had after Flannery spoke in June and in October, the stock fell. Shares drifted below $20.\n\nDeep inside the disappointing three-hour presentation was a little-noticed warning from Jamie Miller, Jeff Bornstein's replacement as chief financial officer: The ghost of an insurance business that investors thought the company had rid itself of years before would prevent GE Capital from sending the $3 billion it had promised to headquarters.\n\nIn 2004, GE spun off most of its insurance holdings into Genworth Financial, and the remainder was largely sold to Swiss Reinsurance Co. two years later.\n\nTop executives celebrated the move often in public statements. Immelt said that GE might not have survived the financial crisis if it hadn't shed the insurance operations, an example he and his supporters used to demonstrate his astute deal timing.\n\nBut when GE spun off Genworth, there was a chunk of the business, long-term-care insurance, that lingered. Policies designed to cover expenses like nursing homes and assisted living had proved to be a disaster for insurers who had drastically underestimated the costs.\n\nThe bankers didn't think the long-term-care business could be part of the Genworth spinoff. To make the deal more attractive, GE agreed to cover any losses. This insurance for insurers covered about 300,000 policies by early 2018, about 4% of all such policies written in the country. Incoming premiums weren't covering payouts.\n\n(MORE TO FOLLOW) Dow Jones Newswires\n\n12-15-18 0247ET","lang":"eng","eventUri":"null","isDuplicate":false}
{"id":"1019004836","title":"Podcast | Digging Deeper - Airline without a pilot? Greg Taylor (Indi)Gone?","url":"","date":"2018-12-15","text":"The change in personnel, both in the cockpit and the board room of Indigo Airlines, is the topic of this episode of Digging Deeper.\n\nIndigo Airlines, with 200 airplanes in its fleet, is the largest airline in the country, and also the first to achieve the feat. In a year that has not been kind to the aviation industry, Indigo seems to have escaped some of the year's worst tyrannies, but only just.\n\nWhile Indigo topped up capacity by 30 percent year-on-year in October, the rise in the rest of the sector was a smidge above 9 percent year-on-year. For comparison, the sector saw an year-on-year growth of 18.9 percent in June, and 12.3 percent year-on-year in August. Analysts who spoke to Financial Express said that Indigo is leveraging a strong balance sheet to gain market share and remains largely unfazed by falling yields. While that seems hunky dory, all is not well at the top. Indigo's ambitious expansion plans notwithstanding, it remains a company without a full-time CEO.\n\nIn April, when we discussed the exit of Aditya Ghosh from Indigo, we said there was a churn afoot at Indigo. That churn has kept on churning. Multiple sources have told Moneycontrol that a possible difference of opinion between Indigo founders Rahul Bhatia and Rakesh Gangwal may be at the heart of the ongoing top management rejig at Indigo.\n\nThese differences, Prince Mathews Thomas reports for Moneycontrol, may even have led to the resignation of Greg Taylor, a senior advisor who was tipped to be the next CEO. Although the airline is yet to comment on the exit, The Financial Express and Business Standard have said that Taylor is on the way out. There is speculation also that the recent appointment of Ronojoy Dutta as a Principal Consultant at Indigo may have also had a role to play in Taylor making an exit, stage left.\n\nThe story of the missing pilot in the airline is what we will dig deeper into on this edition of Digging Deeper.\n\nChoppy at the top\n\nIndigo needs a full-time CEO but its founder Rahul Bhatia, in an interaction with Moneycontrol, says the carrier is not going to rush through the decision. He also denied that he and co-founder Rakesh Gangwal had disagreements on the choice of a new candidate. \"How can we have differences when we haven't appointed a CEO?\" he asked.\n\nThe role of Chief Executive has stayed empty since the exit of blue-eyed boy Aditya Ghosh (now at the helm of OYO). Since Ghosh's exit, co-founder Bhatia has donned the additional role of interim CEO.\n\nGreg Taylor was tipped to fill the role of CEO, but Business Standard reports that Taylor has communicated his desire to leave the company at the end of December. The reason according to people in the know? The appointment of Ronojoy Dutta, ex-President of United Airlines and ex-CEO of Air Sahara, as principal consultant. Dutta, announcing his appointment last month, said he would develop a five-year plan for the airline and report to Bhatia.\n\n\"Taylor didn't see a future with the company after Dutta was brought in,\" an industry executive told Business Standard.\n\nTaylor was brought into Indigo in 2016 as executive vice-president of revenue management - Taylor's area of expertise - and network planning at the behest of his one-time colleague at United Airlines. With over forty years of experience in various roles he held at United and US Airways, Taylor's appointment was seen as part of Indigo's aggressive growth plan.\n\nTaylor brought with him a new team, largely comprising of foreign nationals who had held important roles in the aviation industry outside of India. Michael Swiatek, an executive from Chile's LATAM came in as Chief Planning Officer; William Boulter, of TAAG Angola Airlines and Etihad vintage, was appointed Chief Commercial Officer; Cindy Szadokierski was appointed Vice President of airport operations; Scott Brandt was named Vice President of corporate planning and analysis.\n\nFollowing this spate of foreign national appointments - incidentally a trend quite common in the Indian aviation sector - we saw a few exits at Indigo, most notably Aditya Ghosh and Sanjay Kumar.\n\nAfter Aditya's exit, it was widely believed that Taylor would take over as CEO. Until of course Dutta came into the picture. A senior executive at Indigo told Moneycontrol: \" It was clear that only one of them could exist at the airline.\"\n\nFounder vs Founder\n\nTaylor was said to be Gangwal's choice for the top job, and Dutta Bhatia's. Thomas writes this was not the first time Bhatia had reached out to Dutta. \"Bhatia had tried tapping Dutta even as he was setting up IndiGo in 2005. But instead of Dutta, Bruce Ashby who was a veteran at US Airways (where Gangwal was once President & COO) became IndiGo's first CEO,\" said a senior executive at Indigo.\n\nRubbishing the notion that there were differences between the founders, Bhatia added that Dutta has been a \"long-time friend of both me and Rakesh (Rakesh Gangwal is the co-founder of IndiGo). We are good friends and have known him professionally and personally.\" He added, \"For the moment he is putting together a plan and he is very good at putting things together and putting a strategy together. I will rely on him and then we will see how the future is going.\"\n\nBhatia declined to put a timeline on when the next CEO will be announced.\n\nBhatia said that the airline is organising itself to make the most of the opportunities in the domestic and international markets.\n\n\"We are going through so much change. We are organising ourselves and new capacity is coming in,\" he said, and added that the airline will start inducting A321 Neo aircraft from \"next week.\"\n\nThe aircraft is more fuel efficient and has a higher capacity. The plane will add to IndiGo's international plans.\n\n\"There are great possibilities nationally and internationally. Domestically too, we are now flying to destinations we never thought we would earlier,\" he said.\n\nBhatia added that the airline is on a recruitment mode and is creating a bench strength. \"We are preparing for a bigger future,\" he said.\n\nOver the years, IndiGo has grown rapidly while also being one of the few airlines to consistently make a profit. Last quarter, it posted a loss for the first time ever.\n\nThe strengthening of the rupee and correction in crude rate will \"improve the situation,\" said the entrepreneur. The two factors had led to the airline announcing its first quarterly loss since the time of its listing.\n\nWho is Ronojoy Dutta?\n\nDutta, an alumnus of IIT Kharagpur and Harvard Business School and a veteran of the American airline industry, has been tasked to frame a five-year business plan for IndiGo at a time when India's largest airline is furiously adding capacity. And the airline has big ambitions for international operations. This is a crucial time, and the role of the chief executive would be critical in pulling off the plans.\n\nDutta and Gangwal were colleagues at United Airlines. Later Dutta headed the airline, even as Gangwal was spearheading rival US Airways. With over 25 years of experience in the aviation industry, Dutta has a lot to offer. From July 2004 until 2006 he served as chairman of Air Sahara, and from 2004 until 2008 Dutta served as the president of Sahara Airline Limited.\n\nHe took on full responsibility of a $400 million full-service airline with a route system including 25 cities along with 44 aircraft. HE later grew sales at 35 percent a year. In 2007, Dutta joined US-based AAR Corporation as a strategic adviser for the Indian market. From 1995 until 1999, prior to becoming the president of United Airlines, Dutta served as the senior vice president of planning and revenue management.\n\nDutta's experience in the international market will be relevant for IndiGo, and also his relationships with his industry peers, as the Indian airline reaches out to international players for codeshare. Reports have pointed out that IndiGo is already in talks with Qatar Airways and Turkish Airlines for codeshare agreement.\n\nA codeshare agreement allows passengers to tap networks of the two airlines.\n\nDutta will work in tandem with Wolfgang Prock-Schauer, who was appointed COO of IndiGo in January.\n\nAviation sector woes and Indigo bucking the trend (somewhat)\n\nAnalysts at ICICI Securities recently wrote, \"Jet Airways and Air India continue to suffer from basic working capital like payroll spend; Vistara and AirAsia are still in deep losses and SpiceJet and Go struggle to prevent balance sheet erosion.\"\n\nIn October 2018, SpiceJet reported a share of 11.7 percent, its lowest in more than two years, reported Financial Express. GoAir, on the other hand, had only 8.8 percent compared with the 2018 average of 9 percent. Jet Airways and its low-cost subsidiary JetLite commanded a share of 14.9 percent and national carrier Air India had 12.2 percent.\n\nIndigo, the leader of the pack, had a 42.8 percent share in October 2018. Its strong cash balances of 12,702 crore rupees at the end of September indicate a phenomenon that is against the current trend in the Indian aviation sector.\n\nThe double whammy of crude prices going up and depreciation of the rupee had clearly hit the sector in India. But with crude prices down about 30 percent from peak levels and the rupee off its all-time lows, airlines may yet heave a sigh of relief. Industry watchers say Indigo will benefit the most.\n\n\"We expect a year over year capacity increase in terms of available seat kilometres of 35 percent for the third quarter. For the full year, we expect capacity increase of 30 percent,\" Rahul Bhatia, interim CEO, IndiGo, said at an earnings call.\n\nThe airline has 202 aircraft, a mix of Airbus A320s and ATR 72s and will be inducting its first Airbus A321neo later this month. As of now, overseas operations still account for less than 10 per cent of IndiGo' total daily flights (115 flights daily to 15 overseas destinations), but the airline's sights are set firmly on expanding into international airspace.\n\nThe airline has launched new destinations - Male, Phuket, and Hong Kong - and introduced a service between Amritsar-Dubai and Vijayawada-Singapore. It has also expanded services to Abu Dhabi, Doha, and Kuwait. Currently, it serves 15 overseas destinations with 115 daily flights. Like we said earlier, Indigo is also in talks with Qatar Airways and Turkish Airlines for commercial partnerships, including interline and codeshares.\n\n\"For a low-cost airline, an interline and codeshare could help it get higher revenue per flight. The origin and destination traffic to Doha alone are not enough for growth. The incremental interline traffic will help tide over low seasons and give a huge fillip to their distribution, which is currently restricted to the website, select partners and general sales agents,\" said aviation expert Ameya Joshi to Business Standard.\n\nThe runway ahead\n\nBusiness Standard also reported that IndiGo will seek board approval for Dutta's appointment soon. Till then, promoter Bhatia will continue to act as interim CEO. \"The airline has already formed a core team of departmental heads to take decisions. With the demise of Devdas Mallya last month, the board of IndiGo has to appoint a new chairman for passing the resolution.\"\n\nA person aware of the development told the daily, \"The promoters are looking for someone who can lead the company for the next five years. The executives that IndiGo has brought in are all experts in their domain. They are so busy planning new destinations, improving revenue or ground services, that none of them has the time to take a top view of the airline. A CEO has to be on ground, talk to the pilots and boost the morale of the ground staff.\"\n\nWhile we do not have confirmation from the airline about these developments, what is undeniable is the need for a full-time CEO sooner rather than later considering the soaring plans Indigo has coloured for itself.","lang":"eng","eventUri":"null","isDuplicate":false}
{"id":"1020005401","title":"S$24 million in buybacks; Medinex makes debuts on Catalist, - THE","url":"","date":"2018-12-16","text":"FOR the 2018 year through to Dec 13, the Straits Times Index (STI) generated a 5.8 per cent decline in total return, amid regional moves that have ranged from a 0.9 per cent decline for the Nikkei 225 Index to a 20.8 per cent decline for China's CSI 300 Index.\n\nFor the five trading sessions ended Dec 13, the STI generated a marginal decline of 0.1 per cent, while the Hang Seng Index, Nikkei 225 index and S&P/ASX 200 averaged a 0.8 per cent gain.\n\nShare buybacks\n\nThere were 17 stocks conducting buybacks over the five sessions ended Dec 13, similar to the 16 stocks for the preceding week.\n\nThe consideration totalled S$24.3 million, marginally up from S$23.1 million filed for the preceding week.\n\nUnited Overseas Bank, Keppel Reit Management, Oversea-Chinese Banking Corporation, Stamford Land Corporation and Venture Corporation led the consideration tally.\n\nHC Surgical Specialists (HCSS) commenced its new buyback mandate; acquiring 180,000 shares on Dec 7. HCSS' previous 12-month mandate saw the company acquire 759,000 shares.\n\nDirector and substantial shareholder transactions\n\nThe five sessions spanning Dec 7 to 13 saw 37 primary-listed stocks lodge 130 changes in director interests or substantial shareholdings.\n\nSimilar to the previous week, there were 25 company director acquisitions and one disposal filed, while substantial shareholders filed 18 acquisitions and two disposals.\n\nMedinex\n\nMedinex, a Singapore-based integrated medical services provider, made its debut on SGX Catalist on Dec 7.\n\nMedinex provides comprehensive medical support and pharmaceutical procurement services to companies in the primary and secondary healthcare sectors, comprising general practitioners and specialists.\n\nThis was the first Catalist stock to be both brought to the market and sponsored by Novus Corporate Finance Pte Ltd.\n\nOf the S$5.32 million in net proceeds raised from the issue of the new shares, the group intends to use S$4 million for the expansion of business operations including expansion of its marketing and business development team and the potential acquisition of Ark Leadership & Learning Pte Ltd and S$1.32 million for working capital.\n\nMedical services group and Catalist-listed HC Surgical Specialists (HCSS) is a substantial shareholder of Medinex.\n\nFollowing the placement, HCSS executive director and CEO Heah Sieu Min and HCSS executive director Chia Kok Hoong maintain a 22.92 per cent deemed interest in Medinex, on account of HCSS' direct interest in the stock.\n\nHSN Healthcare Pte Ltd maintains a 9.5 per cent direct interest in Medinex, which takes the total interest of HCSS in Medinex to 32.42 per cent.\n\nMedinex non-executive chairman John Tan Lee Meng maintains an 8.59 per cent direct stake in the stock, while executive director and CEO Jessie Low Mui Choo maintains a 20.65 per cent direct interest in the stock.\n\nFollowing on from an initial offer price of S$0.250 per share, the stock ended Dec 13 with a share price of S$0.265.\n\nUOB-Kay Hian Holdings\n\nBetween Dec 11 and 12, UOB-Kay Hian Holdings (UOBKH) chairman and managing director Wee Ee Chao increased his total stake in UOBKH from 27.83 per cent to 27.93 per cent.\n\nMr Wee acquired 756,900 UOBKH shares for a consideration of S$900,711.\n\nThe UOBKH chairman has gradually increased his total stake in UOBKH from 26.51 per cent at the end of 2017.\n\nOxley Holdings\n\nBetween Dec 6 and 12, Oxley Holdings (Oxley) executive chairman and CEO Ching Chiat Kwong acquired 1,354,200 shares of Oxley for a consideration of S$394,585.\n\nThis took his total stake in the stock to 41.59 per cent.\n\nAt Oxley, Mr Ching is responsible for the formulation of corporate strategies, charting future growth plans and driving overall performance of the group.\n\nApart from his commitments at Oxley, Mr Ching sits on the boards of Galliard (Group) Ltd, Pindan Group Pty Ltd and Aspen (Group) Holdings Ltd.\n\nBetween Dec 6 and 7, Oxley deputy CEO & executive director Eric Low See Chin acquired 200,000 shares of Oxley for a consideration of S$58,500.\n\nThis increased his direct stake in the home-grown property developer to 27.81 per cent.\n\nMr Low is responsible for business development, as well as supporting Mr Ching in the formulation of corporate strategies and future direction of the group.\n\nMr Low is also a non-executive director of Hafary Holdings where he previously served as CEO.\n\nChina Star Food Group\n\nBetween Dec 11 and 12, China Star Food Group substantial shareholder PTS Capital Pte Ltd acquired 15,358,100 shares of the stock for a consideration of S$379,345.\n\nOn Dec 10, China Star Food Group announced a proposed one-for-one renounceable rights issue at 1.5 cents per rights share, with net proceeds to go towards a partial capital contribution for a China subsidiary as well as working capital in Singapore.\n\nNo Signboard\n\nBetween Dec 6 and 7, GuGong Pte Ltd acquired 1,529,000 shares of No Signboard Holdings for a consideration of S$201,975.\n\nNo Signboard Holdings executive chairman and CEO Sam Lim Yong Sim maintains a 93.64 per cent stake of GuGong Pte Ltd.\n\nWith the acquisition, Mr Lim's total interest in No Signboard Holdings has increased from 74.31 per cent to 74.64 per cent.\n\nMr Lim joined the group in 1998 and has spearheaded its development and expansion over the past two decades.\n\nLHT Holdings\n\nOn Dec 11, LHT Holdings chairman, managing director and CEO Yap Mui Kee acquired 267,100 shares of the stock for a consideration of S$181,628.\n\nThis took her total interest in the manufacturer of high quality wooden pallets, boxes and crates to 13.162 per cent.\n\nMs Yap has been an executive director of the company since 1988 and is in charge of all sales and marketing functions.\n\nShe is also actively involved in the group's Efficient Consumer Response (ECR) pallet rental business in Singapore and Malaysia, and spearheads the group's Radio Frequency Identification ECR Pallet Tracking System.\n\nMs Yap was appointed as LHT Holdings' acting managing director on Feb 26, 2016 and was re-designated as the chairman, managing director and CEO on Feb 10, 2017.\n\nMs Yap's preceding acquisition of LHT Holdings shares was on Nov 30.\n\nHong Lai Huat Group\n\nOn Dec 12, Hong Lai Huat Group deputy chairman and CEO Ong Bee Huat acquired 787,100 shares of the real estate and property developer for a consideration of S$169,227.\n\nHe is the founder of the group and the acquisition increased his direct stake in the stock from 15.23 per cent to 15.58 per cent.\n\nHe is responsible for the group's overall strategic direction and planning as well as business development.\n\nThai Beverage PCL\n\nOn Dec 6, Thai Beverage PCL director and senior executive vice-president Ueychai Tantha-Obhas acquired 200,000 shares of the stock for a consideration of S$121,000.\n\nThis took his total stake in the stock to 0.00211 per cent and followed a similar sized acquisition on June 27.\n\nMr Tantha-Obhas is the current chief of route-to-market for Thai Beverage PCL, and was first appointed as director of the company in 2005.\n\nKoufu Group\n\nOn Dec 11, Jun Yuan Holdings Pte Ltd (Jun Yuan Holdings) acquired 150,000 shares of Koufu Group for a consideration of S$93,000.\n\nThis increased Jun Yuan Holdings' stake in Koufu Group to 78.32 per cent.\n\nBoth Koufu Group executive chairman and CEO Pang Lim and executive director Ng Hoon Tien hold 50 per cent of the shares of Jun Yuan Holdings.\n\nBoth Mr Pang and Mdm Ng are founding shareholders of Koufu Group.\n\nMr Pang is responsible for the overall management and operations of the group, setting and executing the strategic directions and expansion plans for the growth and development of the group.\n\nMdm Ng is responsible for the oversight of the operations of Koufu Group.\n\nMdm Ng also assists Mr Pang in the formulation and implementation of the group's business strategies and the F&B operations of the group.\n\nSing Holdings\n\nBetween Dec 5 and 13, Sing Holdings managing director and CEO Lee Sze Hao acquired 203,300 shares of the stock for a consideration of S$79,037.\n\nThis took Mr Lee's total stake in the stock to 39.39 per cent.\n\nSince Sing Holdings reported its FY17 results in February, he has gradually increased his stake in the company from 38.45 per cent.\n\nMr Lee joined the group as an executive director in 1992, has been CEO since 2009 and has been running the property business for more than 20 years.\n\nSamko Timber\n\nOn Dec 10, Samko Timber executive director and CEO Riko Setyabudhy Handoko acquired 930,000 shares of the stock for a consideration of S$26,740.\n\nHe has served on the Samko Timber Board since June 2016 and maintains a 0.24 per cent direct stake of the stock.\n\nHis previous acquisition of Samko Timber shares was back on Sept 20.\n\nEnviro-Hub Holdings\n\nOn Dec 7, Enviro-Hub Holdings executive chairman Raymond Ng acquired 83,900 shares of the environmental management solutions group for a consideration of S$4,027.\n\nThis took his total stake in the stock to 40.35 per cent.\n\nMr Ng is responsible for the group's overall management, business development, investment decisions as well as strategic direction and planning.\n\nMr Ng has gradually increased his stake in Enviro-Hub Holdings from 39.15 per cent prior to March 7.","lang":"eng","eventUri":"null","isDuplicate":false}
{"id":"1019184966","title":"Inspection- THIS is why an Inexperienced Businessperson as President is a BAD Idea","url":"","date":"2018-12-15","text":"For at least 20 years the right has been trying to sell the \"CEO president\" scam. I have always found the idea of a CEO president an incredibly BAD idea. Government isn't business, nor should it be. Considering the frequent use of our bankruptcy laws, and high numbers of yearly business failures, business isn't a great model for governance, not to mention too many businesses survive because they're basically scams.\n\nDonald Trump is the perfect \"I told you so,\" for all of us who have been warning others for so long.\n\nA CEO's job is more like Saddam, or Pinochet, or Stalin than one who heads one of three branches of the government but is the servant of ALL the people: not just those who agree with him. A sole proprietor is even more like a dictator: king over his own kingdom. Trump isn't really a CEO. He just plays off that fav right wing concept: a CEO president. He's more like the role he played for so long: a really bad sole proprietor. A proprietor who believes everyone serves him. A proprietor who believes being in business means it should be perfectly legal for him to do what you, and I, can't without prison time. To our head oligarch wannabe America's purpose is serve as a piggybank and source of profit for King Trump in all senses of the word 'profit.'\n\nI'm sure you've heard, \"Government should be run like a business.\"\n\nAbsolutely NOT.\n\nWe should have learned during \"our first (failed) CEO president:\" Bush II... the sequel a lot of us never wanted. The sequel Jeb, Katherine and the Supremes insisted we must have. Apparently \"equal protection\" is only for privileged son Republican presidential contenders.\n\nTrump is an even better example of why a businessman as president is an old Electrolux of an idea on full suck. Bush, Junior, at least had been in government: as limited as that experience was, and his father, his cohorts, had plenty of experience. But like any scam artist fixing the intel, using Curveball and ruining those actually trying to do a good job by serving the customer (us), are just part of doing \"just business.\" Who cares who gets killed? Who cares what sources are kacked by Saddam or whomever because it's more important to ruin a husband and wife because the husband challenged a lie about yellow cake?\n\nIt's just business: like telling lies about the competition to put them out of business.\n\n\"Just business\" is an excuse used to do what's morally, what's ethically, wrong. (I use \"ethical\" as in what we do, not just what we claim we believe.) The W. administration used things like \"we know where the WMD is\" like CEOs use rosy reports to corporate boards that gloss over serious corporate problems.\n\nA immoral, unethical CEO or sole proprietor will do anything to put out of business anyone who competes with them honestly, ethically. Example: back before he got into politics Trump found out the Mohawk Indians wanted to start their own casino in the Catskills. As an owner of a casino he openly advocated for New York State not to allow that. No matter what you or I think, he had that right. However he also funded fake advocacy organizations supposedly NOT connected to him claiming Indians were dirty, rapists, selling drugs, would bring in crime... that is illegal. He only escaped prison time by paying one hell of a fine.\n\nSound familiar?\n\nOne might claim Trump has a 'board' and 'stockholders:' but with all the firings, all the election fraud tactics and terrorizing those he appoints he's packing the board with ass kissers and goosesteppers, eliminating the voting rights of those 'stockholders' who challenge his self serving vision. Being conned into not counting all the votes in 2000 is what headed us in this direction: counting became less important than the CEO.\n\nThe problem with this presidential CEO or sole proprietor concept should have been obvious long before Trump. Government's job, and therefore a president's, in a free society is not the same as a CEO and the opposite of a sole proprietor even when they're honest, try to be as ethical as they morally should be.\n\nYes, we should have learned from W and Cheney how bad this idea was. Instead we went deeper down the corporate president rabbit hole. Where are we headed? We're heading towards those whose idea of governance is throwing those who disagree out of planes, disappearing journalists, or hacking them to pieces.\n\nA bad sole proprietor like Trump is not unlike a vampire. Once upon a time he was just a bad business man sucking the sustenance out of failed business to failed business with the help of his father and our bankruptcy laws. He left behind him the economically drained 'corpses' of former employees, vendors and customers who trusted him. Then he got his kicks, fame and riches from humiliating people on TV and being, well there's no other way to put it: an asshole. Now he has the power of both business and government: sinking his teeth deeper into the public aorta than non-presidential bad businessmen. Our taxes, our deficit, serves to enrich Trump, inc. Public figures staying in his hotels, getting more business deals...\n\nA legal stake through his economic heart would be way too good for him. What was it they did to Mussolini?","lang":"eng","eventUri":"null","isDuplicate":false}
{"id":"1019176209","title":"In praise of SLOT, a Nigerian success story","url":"","date":"2018-12-15","text":"Nnamdi not only shares his journey to success, including the 'twist and turns' but also covers his importance of people...\n\nMike Awoyinfa\n\nAll roads lead tomorrow afternoon to the Landmark Event Centre, Victoria Island, Lagos, where Nnamdi Ezeigbo, the entrepreneur who founded 20 years ago SLOT, Nigeria's most successful mobile phones and electronics retail chain business would be making a public presentation of a partly biographical, experiential business book titled ENTREPRENEURSHIP THE SLOT WAY -- Succeeding in a Tough Business Environment.\n\nThe chief presenter of the book is Leonard Stanley Ekeh, the Chairman/CEO of Zinox Technologies Limited, while the chairman of the occasion is Mazi Sam Ohuabunwa, the President, Pharmaceutical Society of Nigeria. Governor of Abia State, His Excellency, Victor Ikpeazu is the Special Guest of honour and the Ooni of Ife, Oba Adeyeye Enitan Ogunwusi, the Royal Father of the day. Mike Awoyinfa, yours sincerely, is the book reviewer. I will bring you my review next week, but meanwhile, these are praises for the book from eminent Nigerians, business leaders and entrepreneurs of note who have read the book and are full of praises for a small book that carries so much weight in terms of what it has to offer.\n\nBukky George, Founder and CEO, HealthPlus Limited: \"In Entrepreneurship the SLOT Way, Nnamdi shares his unique experiences of how he built SLOT into one of the greatest brands in the history of Nigeria, against the odds! It is a candid, inspiring and empowering read for anyone who seeks to create value, wealth and jobs towards transforming the Nigerian economy and contributing their quota to nation-building.\"\n\nMazi Sam Ohuabunwa, Founding Chairman/CEO of Neimeth International Pharmaceuticals Plc: \"Nnamdi Ezeigbo's book, Entrepreneurship the SLOT Way is a cook book in entrepreneurial studies. It is intellectual, yet down to earth and easy to understand. It is simply a testimonial on how Nigeria can unleash the entrepreneurial talent that abounds in our nation in order to eradicate unemployment and poverty. Using his experience in founding and running SLOT as a case study, Nnamdi teaches what makes an entrepreneur as distinct from just a businessman and coaches the rookie entrepreneur on how to build a business focusing on Solution, Learning/Leadership, Opportunities and Technology (SLOT) while creating value, jobs and wealth. This is experiential teaching at its best done by a man who has built a business on a solid foundation and with ingredients that will last. It makes for beautiful, easy but highly enlightening reading.\n\nProfessor Pat Utomi, Founder, Center for Value Leadership: \"An entrepreneur is essentially a change agent who provides leadership that bridges a dissatisfaction gap and profits therefrom. Showing others how this quantum leap in value creation is done without the resources ordinarily required for it, makes him a teacher. Nnamdi Ezeigbo, founder of SLOT, outdoes many in sharing insights from The SLOT Way. It is a tonic and valuable elixir for Nigeria and African continent desperate for new growth and the Great Escape from misery for its ballooning population. Entrepreneur wannabes can adopt and adapt his ideas and win.\"\n\nMike Awoyinfa, Pioneer MD/CEO of The Sun newspaper, author of 50 Nigeria's Corporate Strategist: Top CEOs Share Their Experiences in Managing Companies in Nigeria: \"This is a hands-on toolkit on entrepreneurship written straight from the heart of a man who has lived a successful entrepreneurial life. In every page, you will find golden nuggets of entrepreneurial wisdom to equip and motivate potential entrepreneurs into believing that entrepreneurship is the key to the Nigeria of the 21st century.\"\n\nSenator Theodore Orji, Former Governor of Abia State: \"This three sectioned book, Entrepreneurship the SLOT Way, is a new window into entrepreneurial operations typifying John Dewey's theory of pragmatism and revealing that knowing is doing. It lays a solid foundation for teeming generations, old and young, male and female. This is a rare approach as most Nigerians, especially the trader class, believe that making such forays as Nnamdi Ezeigbo has made in his book, could endanger their business secrets. This book potently advocates understudying pioneers and predecessors in different fields so as to evolve successful patterns.\"\n\nEmeka Onwuka, former MD, Diamond Bank, Former Chairman, Enterprise Bank: \"Simple, practical and realistic, Entrepreneurship the SLOT Way is packed with insights on strategy, innovation and a truly entrepreneurial mindset. It explains how to grow a business successfully in the peculiar Nigerian business environment and a rapidly changing and highly competitive global market space.\"\n\nEmmanouil Revmatas, Director (Information and mobility), Samsung, Nigeria: \"From the man who spearheaded the technology retail revolution in Nigeria, this book provides valuable insight and advice for anyone interested in the topic of entrepreneurship, particularly within a developing society. Filled with real life examples and practical tips, Nnamdi not only shares his journey to success, including the 'twist and turns' but also covers his importance of people, whether they are staff, partners or customers.\"\n\nAdeniyi Adekunle, Entrepreneur, Nation Builder and Author, Nigeria's Call Obey: \"Entrepreneurship the SLOT Way is a practical, applicable and straight to the point book. It is clear that Nnamdi Ezeigbo has a deep understanding of how to run a business and he is very conversant with the realities of doing so in a developing country like Nigeria. This book is brilliant.\"\n\nDr. Enase Okonedo, Dean Lagos Business School, Pan-African University, Nigeria: \"This is a practical advice given by the CEO of one of the fastest growing and innovative companies in Nigeria on how to build a thriving and sustainable business enterprise. Beginning as a phone repairer and growing a business that traverses Nigeria with ambitions to conquer Africa, he attributes his success to a focus on value creation rather than just 'doing business', and openness to learning. His advice stemming from his experience of starting and growing a business in an oft-challenging environment shared in this book is useful, credible and proven I believe all entrepreneurs and would-be entrepreneurs will likewise benefit from being open to the lessons shared in this book by Nnamdi.\"\n\nOkezie Victor Ikpeazu, Governor, Abia State: \"This is an amazing piece of work. It is phenomenal and timely especially now that our country, Nigeria, is negotiating a difficult and treacherous socio-economic bend. Government and individuals have taken many wide shots in many directions all in the bid to create more entrepreneurs and strengthen the existing ones, sadly these efforts have not yielded results, because Nigeria had not seen and read ENTERPRENEURSHIP THE SLOT WAY. Nnamdi Ezeigbo's intervention, himself an engineer and a successful entrepreneur is certainly the missing link in our search for sustainable economic growth. This book can mould your mindset and make you a solution provider within the difficult Nigerian business environment. Its academic depth, laced with everyday examples makes the book simple and wonderful.\"","lang":"eng","eventUri":"null","isDuplicate":false}
