{"id":"21973D0305(01)","text":"\n\n\n\n\n\n\n\n\nAvis juridique important\n\n\n\n\n|\n\n\n\n21973D0305(01)\n\nDecision No 4\/72 of the Association Council on the definition of the concept of 'originating products' from Turkey for implementation of Chapter I of Annex No 6 of the Additional Protocol to the Ankara Agreement  \n\n\nOfficial Journal L 059 , 05\/03\/1973 P. 0083 - 0084 Finnish special edition: Chapter 2 Volume 2 P. 0004  Swedish special edition: Chapter 2 Volume 2 P. 0004  Spanish special edition: Chapter 02 Volume 2 P. 0013  Portuguese special edition Chapter 02 Volume 2 P. 0013  \n\n\n\n\n\nDECISION No 4\/72 OF THE ASSOCIATION COUNCIL on the definition of the concept of 'originating products' from Turkey for implementation of Chapter I of Annex No 6 of the Additional Protocol to the Ankara AgreementTHE ASSOCIATION COUNCIL, Having regard to the Agreement establishing an Association between the European Economic Community and Turkey; Having regard to the Additional Protocol referred to in Article 1 (1) of the Provisional Protocol annexed to that Agreement, and in particular Article 16 of Annex 6; Whereas in view of the provisions of Articles 31, 32 and 35 of the Additional Protocol, agricultural products and products subject to special rules on importation into the Community as a result of the implementation of the common agricultural policy can only benefit from the preferential treatment laid down in Annex No 6 if they satisfy the conditions set out in Articles 2 and 3 of that Protocol; Whereas, with the exception of a few products that have to be wholly obtained in Turkey, the products referred to in the preceding recital may benefit from the preferential treatment only if they also originate in Turkey; Whereas in order to promote the marketing of Turkish agricultural products, products obtained by working or processing imported agricultural products should be excluded from the concept of products originating in Turkey; whereas, on the other hand, to avoid hampering the processing industries it should be laid down that the accessory use of other imported products in the working or processing of native products, does not prevent the goods obtained from being considered as originating; HAS DECIDED AS FOLLOWS : Article 1 For the purposes of implementing Chapter I of Annex No 6 of the Additional Protocol, the following shall be considered as 'originating products' from Turkey: (a) vegetable products harvested in Turkey, (b) live animals born and raised in turkey, (c) products from live animals raised in Turkey, (d) products obtained by hunting or fishing conducted in Turkey, (e) marine products taken from the sea by Turkish vessels, (f) goods obtained in Turkey by working or processing the products specified in subparagraphs (a) to (e), even if other products were incorporated on an accessory basis in their manufacture, whatever the origin of these products. Article 2 The explanatory notes form an integral part of this Decision. Done at Brussels, 29 December 1972. For the Association CouncilThe President E. M. J. A. SASSEN  EXPLANATORY NOTES Note 1 The term 'in Turkey' shall also cover territorial waters and vessels operating on the high seas, including factory ships, on which the fish caught is worked or processed, provided that they satisfy all the conditions set out in Explanatory Note 4. Note 2 In order to determinate whether goods originate in Turkey, it shall not be necessary to establish whether the power and fuel, plant and equipment and machines and tools used to obtain such goods originate in third countries or not. Note 3 In determining the origin of agricultural products, account shall not be taken of any packaging. Note 4 The term 'Turkish vessels' shall apply only to vessels: - which are registered or recorded in Turkey; - which sail under the Turkish flag; - which are at least 50% owned by nationals of Turkey or by a compagny with its head office in Turkey, of which the manager or managers, chairman of the board of directors or of the supervisory board and the majority of the members of such boards are nationals of Turkey and of which, in addtion, in the case of partnerships or limited companies, at least half the capital belongs to Turkey, or to public bodies or nationals of Turkey; - of which the captain and officers are all nationals of Turkey; - of which at least 75% of the crew are nationals of turkey. Note 5 Products in a quantity not exceeding 10% of that of the products referred to in subparagraphs (a) to (e) of Article 1 of the Decision shall be considered as being incorporated on an accessory basis in their manufacture. \n\n\n\n\nTop  \n\n","text_len":4589,"text_n_words":758}
{"id":"21974A1010(01)","text":"\n\n\n\n\n\n\n\n\nAvis juridique important\n\n\n\n\n|\n\n\n\n21974A1010(01)\n\nSupplementary Protocol to the Agreement of 28 July 1956 between the Federal Council of the Swiss Confederation, of the one part, and the Governments of the Member States of the European Coal and Steel Community and the High Authority of the European Coal and Steel Community, of the other part, on the introduction of through international railway tariffs for the carriage of coal and steel through Swiss territory  \n\n\nOfficial Journal L 012 , 18\/01\/1979 P. 0015 - 0026 Greek special edition: Chapter 02 Volume 7 P. 0034  Spanish special edition: Chapter 07 Volume 2 P. 0139  Portuguese special edition Chapter 07 Volume 2 P. 0139  \n\n\n\n\n\nSUPPLEMENTARY PROTOCOL  to the Agreement of 28 July 1956 (1) between the Federal Council of the Swiss Confederation, of the one part, and the Governments of the Member States of the European Coal and Steel Community and the High Authority of the European Coal and Steel Community, of the other part, on the introduction of through international railway tariffs for the carriage of coal and steel through Swiss territory  Signed on 10 October 1974  Entered into force on 17 September 1978  (79\/38\/ECSC)   THE FEDERAL COUNCIL OF THE SWISS CONFEDERATION (hereinafter called \"the Federal Council\"),  of the one part, and  THE GOVERNMENTS OF THE MEMBER STATES OF THE EUROPEAN COAL AND STEEL COMMUNITY (hereinafter called \"the Community\") AND THE COMMISSION OF THE EUROPEAN COMMUNITIES,  of the other part,  HAVE AGREED AS FOLLOWS:        Article 1 The Governments of the Kingdom of Denmark, Ireland and the United Kingdom of Great Britain and Northern Ireland hereby accede to the Agreement of 28 July 1956 between the Federal Council of the Swiss Confederation of the one part, and the Governments of the Member States of the European Coal and Steel Community and the High Authority of the European Coal and Steel Community, of the other part, on the introduction of through international railway tariffs for the carriage of coal and steel through Swiss territory (hereinafter called \"the Agreement\").  Article 2 The Danish and English texts of the Agreement, annexed as the original texts.  (1)OJ (ECSC) No 17, 29.5.1957, p. 223\/57.    Article 3 The Commission of the European Communities shall accept this Protocol as binding by virtue of its signature.  The Government of each Member State of the Community shall notify the Federal Council that the conditions necessary for the entry into force of this Protocol have been fulfilled in accordance with the provisions of its domestic law.  This Protocol shall enter into force one month after the date on which the Federal Council has informed the other Parties to the Agreement that the notification provided for in the second subparagraph has been received and that the conditions necessary for the entry into force of this Protocol have been fulfilled in accordance with the provisions of Swiss law.   Article 4 This Protocol shall be deposited with the Federal Council. The Federal Council shall transmit certified true copies thereof to the Governments of the Member States of the Community and to the Commission of the European Communities.     \n\n\n\n\nTop  \n\n","text_len":3207,"text_n_words":511}
{"id":"21976A0624(01)","text":"\n\n\n\n\n\n\n\n\n\n\n\n\n18.11.1977   \n\n\nEN\n\n\nOfficial Journal of the European Communities\n\n\nL 295\/15\n\n\n\n\n\nADDITIONAL PROTOCOL TO THE EUROPEAN AGREEMENT ON THE EXCHANGE OF TISSUE-TYPING REAGENTS\nTHE SIGNATORY STATES TO THE EUROPEAN AGREEMENT ON THE EXCHANGE OF TISSUE-TYPING REAGENTS,\nhereinafter called the ‘Agreement’.\nRecalling the provisions of Article 5 (1) of the Agreement, whereby the Contracting Parties shall take all necessary measures to exempt from all import duties the tissue-typing reagents placed at their disposal by the other Parties;\nWhereas, with regard to the Member States of the European Economic Community, the undertaking to grant such exemption falls within the competence of the said Community which possesses the necessary powers for this purpose by virtue of the Treaty establishing the Community;\nWhereas, for the purposes of applying Article 5 (1) of the Agreement, the European Economic Community should therefore be a Contracting Party to the Agreement,\nHAVE AGREED AS FOLLOWS:\nArticle 1\nThe European Economic Community may become a Contracting Party to the Agreement by virtue of signing that Agreement.\nArticle 2\nThis Additional Protocol shall be open for signature by the States signatory to the Agreement who may become party to the Additional Protocol by following the procedure laid down in Article 7 of the Agreement.\nArticle 3\nNo Member State may become a Contracting Party to the Agreement without at the same time becoming a Contracting Party to this Additional Protocol, which shall form an integral part of the Agreement.\nArticle 4\nThis Additional Protocol shall enter into force at the same time as the Agreement.\nArticle 5\nThe Secretary-General of the Council of Europe shall notify Member States of the Council and the European Economic Community of:\n\n\n\n\n\n\n(a)\n\n\nall signatures of this Additional Protocol;\n\n\n\n\n\n\n\n\n\n\n(b)\n\n\nthe deposit of all instruments of ratification or of acceptance;\n\n\n\n\n\n\n\n\n\n\n(c)\n\n\nthe date of entry into force of this Additional Protocol.\n\n\n\n\n\n\nTop  \n\n","text_len":2012,"text_n_words":306}
{"id":"21977A0919(02)","text":"\n\n\n\n\n\n\n\n\nAvis juridique important\n\n\n\n\n|\n\n\n\n21977A0919(02)\n\nAdditional Agreement to the Agreement, signed in Berne on 29 April 1963, concerning the International Commission for the Protection of the Rhine against Pollution  \n\n\nOfficial Journal L 240 , 19\/09\/1977 P. 0048 - 0065 Spanish special edition: Chapter 15 Volume 2 P. 0058-0059  Portuguese special edition Chapter 15 Volume 2 P. 0058-0059  DA L 240 19\/09\/1977 P. 0064-0065 DE L 240 19\/09\/1977 P. 0064-0065 EN L 240 19\/09\/1977 P. 0048-0049 FR L 240 19\/09\/1977 P. 0048-0049 IT L 240 19\/09\/1977 P. 0064-0065 NL L 240 19\/09\/1977 P. 0064-0065 \n\n\n\n\n\nAdditional agreement to the Agreement, signed in Berne on 29 April 1963, concerning the International Commission for the Protection of the Rhine against PollutionZUSATZVEREINBARUNG zu der in Bern am 29. April 1963 unterzeichneten Vereinbarung über die Internationale Kommission zum Schutz des Rheins gegen Verunreinigung DIE REGIERUNG DER BUNDESREPUBLIK DEUTSCHLAND, DIE REGIERUNG DER FRANZÖSISCHEN REPUBLIK, DIE REGIERUNG DES GROßHERZOGTUMS LUXEMBURG, DIE REGIERUNG DES KOENIGREICHS DER NIEDERLANDE, DIE REGIERUNG DER SCHWEIZERISCHEN EIDGENOßENSCHAFT UND DIE EUROPÄISCHE WIRTSCHAFTSGEMEINSCHAFT, im Hinblick auf die Vereinbarung über die Internationale Kommission zum Schutz des Rheins gegen Verunreinigung und das ihr beigefügte Unterzeichnungsprotokoll, die in Bern am 29. April 1963 unterzeichnet wurden, im Hinblick auf das Übereinkommen zum Schutz des Rheins gegen chemische Verunreinigung, im Hinblick darauf, daß es für die Europäische Wirtschaftsgemeinschaft auf Grund ihrer Zuständigkeit notwendig ist, Vertragspartei der in Bern am 29. April 1963 unterzeichneten Vereinbarung zu werden, SIND WIE FOLGT ÜBEREINGEKOMMEN:Artikel 1Die Europäische Wirtschaftsgemeinschaft wird zum Zeitpunkt des Inkrafttretens dieser Zusatzvereinbarung Vertragspartei der Vereinbarung über die Internationale Kommission zum Schutz des Rheins gegen Verunreinigung und des ihr beigefügten Unterzeichnungsprotokolls (im folgenden als \"die Vereinbarung\" bezeichnet), die in Bern am 29. April 1963 unterzeichnet wurden. Artikel 2Die Vereinbarung wird wie folgt geändert:a) Der Ausdruck \"unterzeichnete Regierungen\" wird durch den Ausdruck \"Vertragsparteien\" ersetzt. b) Artikel 4 Absatz 1 wird durch folgenden Absatz ersetzt: \"(1) Die Einzelheiten der Wahrnehmung des Vorsitzes der Kommission durch die Delegationen werden von der Kommission bestimmt und in ihre Geschäftsordnung aufgenommen ; die Delegation, welche den Vorsitz wahrnimmt, benennt eines ihrer Mitglieder als Präsidenten der Kommission.\" c) In Artikel 6 wird nach Absatz 1 folgender Absatz eingefügt: \"(2) In den in ihre Zuständigkeit fallenden Bereichen steht der Europäischen Wirtschaftsgemeinschaft eine Anzahl von Stimmen entsprechend der Anzahl ihrer Mitgliedstaaten zu, die Vertragsparteien dieser Vereinbarung sind. Die Europäische Wirtschaftsgemeinschaft übt ihr Stimmrecht in Fällen, in denen ihre Mitgliedstaaten ihr Stimmrecht ausüben, nicht aus ; das gleiche gilt im umgekehrten Fall.\" Artikel 6 Absatz 2 wird Artikel 6 Absatz 3. Artikel 6 Absatz 3 wird Artikel 6 Absatz 4 ; er wird wie folgt ergänzt: \"Dies gilt nicht für die Delegation der Europäischen Wirtschaftsgemeinschaft.\" d) Artikel 12 Absatz 2 wird durch folgenden Absatz ersetzt: \"(2) Die übrigen Kosten der Arbeiten der Kommission werden in folgendem Verhältnis zwischen den Vertragsparteien aufgeteilt:>PIC FILE= \"T0010436\">  Die Kommission kann in bestimmten Fällen auch eine andere Aufteilung festlegen.\"Artikel 3(1) Die Delegation, welche den Vorsitz der Kommission bei Inkrafttreten der Zusatzvereinbarung ausübt, nimmt den Vorsitz weiterhin bis zum Ablauf ihrer dreijährigen Amtszeit wahr. (2) Die Einzelheiten der weiteren Wahrnehmung des Vorsitzes der Kommission durch die Delegationen werden vor Ablauf der in Absatz 1 genannten Amtszeit von der Kommission unter Berücksichtigung ihrer neün Zusammensetzung bestimmt. Artikel 4(1) Jede Unterzeichnerpartei notifiziert der Regierung der Schweizerischen Eidgenossenschaft, daß ihre Verfahren zum Inkrafttreten dieser Zusatzvereinbarung durchgeführt sind. (2) Die Regierung der Schweizerischen Eidgenoßenschaft unterrichtet die Vertragsparteien vom Zeitpunkt des Eingangs dieser Notifikationen. Diese Zusatzvereinbarung tritt gleichzeitig mit dem Übereinkommen zum Schutz des Rheins gegen chemische Verunreinigung in Kraft. Artikel 5Diese Zusatzvereinbarung, die in einer Urschrift in deutscher, franzoesischer und niederländischer Sprache abgefaßt ist, wobei jeder Wortlaut gleichermaßen verbindlich ist, wird im Archiv der Regierung der Schweizerischen Eidgenoßenschaft hinterlegt ; diese übermittelt jeder Vertragspartei eine beglaubigte Abschrift. Geschehen zu Bonn am 3. Dezember 1976. Für die Regierung der Bundesrepublik Deutschland: Für die Regierung der Franzoesischen Republik: Für die Regierung des Großherzogtums Luxemburg: Für die Regierung des Koenigreichs der Niederlande: Für die Regierung der Schweizerischen Eidgenoßenschaft: Für die Europäische Wirtschaftsgemeinschaft \n\n\n\n\nTop  \n\n","text_len":5080,"text_n_words":666}
{"id":"21980A0430(01)","text":"\n\n\n\n\n\n\n\n\nAvis juridique important\n\n\n\n\n|\n\n\n\n21980A0430(01)\n\nAgreement negotiated between the European Economic Community and Canada under Article XXVIII of GATT concerning certain products in the fruit and vegetables sector  \n\n\nOfficial Journal L 111 , 30\/04\/1980 P. 0018 - 0021 Greek special edition: Chapter 11 Volume 19 P. 0237  \n\n\n\n\n\nAGREEMENT negotiated between the European Economic Community and Canada under Article XXVIII of GATT concerning certain products in the fruit and vegetables sectorThe attached papers record the results of negotiations between the Canadian delegation and the Commission of the European Communities under Article XXVIII of GATT for the modification of concessions provided for in Schedule V - Canada.On behalf of the delegation ofthe Commission ofthe European CommunitiesOn behalf ofthe Canadian delegationMr Olivier Long,Director-General,GATT Secretariat,Centre William Rappard,rue de Lausanne, 154CH-1211 GenevaNegotiations relating to Schedule V - CanadaThe Canadian delegation and the Commission of the European Communities have concluded their negotiations under Article XXVIII for the modification of concessions provided for in Schedule V - Canada, as set out in the report attached.On behalf of the delegation ofthe Commission ofthe European CommunitiesOn behalf ofthe Canadian delegationResults of negotiations between Canada and the European Communities under Article XXVIII for the modifications of concessions in Schedule V - CanadaChanges in Schedule V - CanadaNoteThe concessions listed in Annex A shall be replaced by those listed in Annex B. Unless otherwise specified any item listed in Annex B confers upon the European Communities initial negotiating rights.ANNEX ATTTABLEANNEX BTTTABLECanadian delegation16 October 1979Dear Mr Villain,Please find attached the results of negotiations between the Canadian delegation and the Commission of the European Communities under Article XXVIII of GATT for the modification of concessions provided for in Schedule V - Canada.These negotiations have been conducted on the basis of Part I of Schedule V - Canada, and are without prejudice to the views of either Canada or the European Communities as to the status of Part II bindings, discussions on which may take place elsewhere.Yours sincerely,Canadian delegationMr. C. Villain,Director-General,Agricultural Directorate,Commission of the European Communities,200 rue de la Loi,B- 1049 Brussels.Canadian delegation16 October 1979Dear Mr Villain,This is to confirm that, in accordance with the settlement worked out between our delegations relating to the modification of concessions in the fruit and vegetables sector of Schedule V - Canada, Canada agrees that the British preferential rate [1] on tariff item No 6605-1 (biscuits, sweetened or unsweetened, valued at not less than 20 cents per pound, said value to be based on the net weight and to include the value of the usual retail package) will not be phased out in such a way that this rate will go above the final MFN concession rate of 5 %.[1] This rate applies to inter alia the United Kingdom of Great Britain and Northern Ireland and to Ireland.Yours sincerly,Canadian delegationMr C. Villain,Director-General,Agricultural Directorate,Commission of the European Communities,200 rue de la Loi,B- 1049 Brussels. \n\n\n\n\nTop  \n\n","text_len":3328,"text_n_words":476}